nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/filesystem/flash_littlefs.c
/*
 * Copyright 2022 NXP.
 * This software is owned or controlled by NXP and may only be used strictly in accordance with the
 * license terms that accompany it. By explittlefs_ressly accepting such terms or by downloading, installing,
 * activating and/or otherwise using the software, you are agreeing that you have read, and that you
 * agree to comply with and are bound by, such license terms. If you do not agree to be bound by the
 * applicable license terms, then you may not retain, install, activate or otherwise use the software.
 */

#include <filesystem/flash_littlefs.h>
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

#include "lfs.h"

#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
#include "fsl_cache.h"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define ATTR_ENCRYPT 0x1

typedef struct _littlefs
{
    lfs_t lfs;
    SemaphoreHandle_t lock;
    struct lfs_config cfg;
    uint8_t lfsMounted;
} littlefs_t;

/*! @brief Structure to hold file meta data during operations */
typedef struct _file_encrypt_info
{
    uint32_t dataEncLen;
    uint32_t dataPlainLen;
    bool useEncryption;
} file_encrypt_info_t;

typedef struct _file_meta
{
    lfs_file_t file;
    struct lfs_file_config cfg;
    struct lfs_attr attrs[1];
    file_encrypt_info_t encryptInfo;
} file_meta_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static int LFS_FlashRead(
    const struct lfs_config *lfsc, lfs_block_t block, lfs_off_t off, void *buffer, lfs_size_t size);
static int LFS_FlashProg(
    const struct lfs_config *lfsc, lfs_block_t block, lfs_off_t off, const void *buffer, lfs_size_t size);
static int LFS_FlashErase(const struct lfs_config *lfsc, lfs_block_t block);
static int LFS_FlashSync(const struct lfs_config *lfsc);

/*******************************************************************************
 * Variables
 ******************************************************************************/
#if FS_ENCRYPTION_SUPPORTED
static const encrypt_ctx_t s_flashLittlefsEncCtx = {
    .key = {0x2c, 0x7d, 0x13, 0x18, 0x26, 0xb0, 0xd0, 0xaa, 0xab, 0xf7, 0x16, 0x88, 0x09, 0xcf, 0x4f, 0x3e},

    .iv = {0xef, 0xf0, 0xf9, 0xec, 0xfc, 0xf1, 0xf4, 0xf9, 0xf8, 0xf9, 0xfa, 0x02, 0xfc, 0xfd, 0xfe, 0xff},

    .keySize = 16,
    .keySlot = 1};
#endif /* FS_ENCRYPTION_SUPPORTED */

static uint32_t s_ErasedBlocks[LFS_SECTORS / 32] = {0x0};
static littlefs_t s_LittlefsHandler          = {};

AT_NONCACHEABLE_SECTION_ALIGN(static uint8_t s_CacheBuffer[LFS_CACHE_SIZE], 8);
AT_NONCACHEABLE_SECTION_ALIGN(static uint8_t s_ReadBuffer[LFS_CACHE_SIZE], 8);
AT_NONCACHEABLE_SECTION_ALIGN(static uint8_t s_WriteBuffer[LFS_CACHE_SIZE], 8);
// the lookahead vector has to be 64bit-aligned (8B) (see below)
AT_NONCACHEABLE_SECTION_ALIGN(static uint8_t s_LookaheadBuffer[LFS_LOOKAHEAD_BUF_SIZE], 8);

static flash_fs_cbs_t s_flashLittlefsCbs = {NULL};

static const struct lfs_config s_LittlefsConfigDefault = {
    // block device driver context data
    .context = NULL,

    // block device operations
    .read  = LFS_FlashRead,
    .prog  = LFS_FlashProg,
    .erase = LFS_FlashErase,
    .sync  = LFS_FlashSync,

    // block device configuration
    .read_size        = FLASH_PAGE_SIZE,
    .read_buffer      = s_ReadBuffer,
    .prog_buffer      = s_WriteBuffer,
    .prog_size        = FLASH_PAGE_SIZE,
    .lookahead_size   = LFS_LOOKAHEAD_BUF_SIZE,
    .lookahead_buffer = s_LookaheadBuffer,

    .cache_size   = LFS_CACHE_SIZE,
    .block_size   = FLASH_SECTOR_SIZE,
    .block_count  = LFS_SECTORS,
    .block_cycles = 100,

};

/*******************************************************************************
 * Code
 ******************************************************************************/

static int _lock(SemaphoreHandle_t lock)
{
    if (lock == NULL)
    {
        return -1;
    }

    if (pdTRUE != xSemaphoreTake(lock, portMAX_DELAY))
    {
        return -1;
    }

    if (s_flashLittlefsCbs.post_lock_cb)
    {
        s_flashLittlefsCbs.post_lock_cb();
    }
    return 0;
}

static int _unlock(SemaphoreHandle_t lock)
{
    if (lock == NULL)
    {
        return -1;
    }

    if (pdTRUE != xSemaphoreGive(lock))
    {
        return -1;
    }

    if (s_flashLittlefsCbs.post_unlock_cb)
    {
        s_flashLittlefsCbs.post_unlock_cb();
    }
    return 0;
}

static bool _is_blockBitSet(uint32_t *blockBitfield, lfs_block_t block)
{
    return blockBitfield[block / 32] & (1U << (block % 32));
}

static void _set_blockBit(uint32_t *blockBitfield, lfs_block_t block)
{
    blockBitfield[block / 32] |= (1U << (block % 32));
}

static void _clear_blockBit(uint32_t *blockBitfield, lfs_block_t block)
{
    blockBitfield[block / 32] &= ~(1U << (block % 32));
}

static int _lfs_traverse_create_used_blocks(void *p, lfs_block_t block)
{
    uint32_t *usedBlocks = p;
    _set_blockBit(usedBlocks, block);
    return 0;
}

static bool _lfs_checkBlockEmpty(lfs_block_t block)
{
    const struct lfs_config lfsc = s_LittlefsConfigDefault;
    uint32_t src                 = (uint32_t)(LFS_BASE_ADDR + block * lfsc.block_size);

    for (int i = 0; i < FLASH_SECTOR_SIZE; i += sizeof(uint32_t))
    {
        uint32_t dst = 0;
        mflash_drv_read((src + i), (uint32_t *)&dst, sizeof(uint32_t));
        /* Compare block with 0xFF to see if it is empty. Consider using defines */
        if (dst != 0xFFFFFFFF)
        {
            return false;
        }
    }
    return true;
}

static int LFS_FlashRead(const struct lfs_config *lfsc, lfs_block_t block, lfs_off_t off, void *buffer, lfs_size_t size)
{
    uint32_t src;
    uint32_t *dst;

    src = (uint32_t)(LFS_BASE_ADDR + block * lfsc->block_size + off);
    dst = (uint32_t *)buffer;

    mflash_drv_read(src, (uint32_t *)dst, size);

    if (((uint32_t)src & 0x03) || ((uint32_t)dst & 0x03) || (size & 0x03))
    {
        return LFS_ERR_IO; /* unaligned access */
    }

    return LFS_ERR_OK;
}

