nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/filesystem/flash_littlefs.c
static int LFS_FlashProg(
    const struct lfs_config *lfsc, lfs_block_t block, lfs_off_t off, const void *buffer, lfs_size_t size)
{
    status_t status;
    uint32_t prog_addr = LFS_BASE_ADDR + block * lfsc->block_size + off;

    for (uint32_t pos = 0; pos < size; pos += lfsc->prog_size)
    {
        status = mflash_drv_page_program(prog_addr + pos, (uint32_t *)((uintptr_t)buffer + pos));
        if (status != kStatus_Success)
        {
            break;
        }
    }

    if (status == kStatus_Fail)
    {
        return LFS_ERR_CORRUPT;
    }
    else if (status != kStatus_Success)
    {
        return LFS_ERR_IO;
    }
    _clear_blockBit(s_ErasedBlocks, block);

    return LFS_ERR_OK;
}

static int LFS_FlashErase(const struct lfs_config *lfsc, lfs_block_t block)
{
    status_t status     = kStatus_Success;
    uint32_t erase_addr = LFS_BASE_ADDR + block * lfsc->block_size;

    if (_is_blockBitSet(s_ErasedBlocks, block))
    {
        /* Block is marked as erased */
        return LFS_ERR_OK;
    }

    if (!_lfs_checkBlockEmpty(block))
    {
        /* The block is not empty, needs erase */
        if (s_flashLittlefsCbs.pre_sector_erase_cb)
        {
            s_flashLittlefsCbs.pre_sector_erase_cb();
        }

        status = mflash_drv_sector_erase(erase_addr);

        if (s_flashLittlefsCbs.post_sector_erase_cb)
        {
            s_flashLittlefsCbs.post_sector_erase_cb();
        }
    }

    if (status == kStatus_Fail)
    {
        return LFS_ERR_CORRUPT;
    }
    else if (status != kStatus_Success)
    {
        return LFS_ERR_IO;
    }

    _set_blockBit(s_ErasedBlocks, block);

    return LFS_ERR_OK;
}

static int LFS_FlashSync(const struct lfs_config *lfsc)
{
    return LFS_ERR_OK;
}

static void LFS_GetDefaultFileConfig(file_meta_t *file)
{
    file->encryptInfo.dataEncLen    = 0;
    file->encryptInfo.dataPlainLen  = 0;
    file->encryptInfo.useEncryption = false;
    file->attrs[0].buffer           = &file->encryptInfo;
    file->attrs[0].size             = sizeof(file->encryptInfo);
    file->attrs[0].type             = ATTR_ENCRYPT;

    file->cfg.buffer     = s_CacheBuffer;
    file->cfg.attrs      = file->attrs;
    file->cfg.attr_count = 1;
}

static int LFS_GetDefaultConfig(struct lfs_config *lfsc)
{
    *lfsc = s_LittlefsConfigDefault; /* copy pre-initialized lfs config structure */
    return 0;
}

static flash_fs_status_t LFS_CheckBasePath(const char *name)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    uint8_t offset            = strlen(name);

    while ((name[offset] != '/') && (offset > 0))
    {
        offset--;
    }

    if (offset != 0)
    {
        /* We have a directory */
        char *basePath = (char *)pvPortMalloc(offset + 1);
        if (basePath != NULL)
        {
            lfs_dir_t dir;
            memset(basePath, 0, offset + 1);
            strncpy(basePath, name, offset);
            if (lfs_dir_open(&s_LittlefsHandler.lfs, &dir, basePath) != 0)
            {
                ret = FLASH_FS_ENOENTRY;
            }
            else
            {
                lfs_dir_close(&s_LittlefsHandler.lfs, &dir);
            }
            vPortFree(basePath);
        }
        else
        {
            ret = FLASH_FS_ENOMEM;
        }
    }

    return ret;
}

static flash_fs_status_t LFS_SaveFileContent(file_meta_t *file_meta, uint8_t *dataIn, uint32_t dataLenIn)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    uint8_t *data             = NULL;
    uint32_t len              = 0;

#if FS_ENCRYPTION_SUPPORTED
    if (file_meta->encryptInfo.useEncryption)
    {
        int32_t status;
        len  = Encrypt_Get_Crypt_Length(dataLenIn);
        data = (uint8_t *)pvPortMalloc(len);
        if (data == NULL)
        {
            ret = FLASH_FS_ENOMEM3;
        }
        else
        {
            status =  Encrypt_AES_CBC_PKCS7(&s_flashLittlefsEncCtx, dataIn, dataLenIn, data, len);
            if (status == ENCRYPT_STATUS_OK)
            {
                file_meta->encryptInfo.dataPlainLen = dataLenIn;
                file_meta->encryptInfo.dataEncLen   = len;
            }
            else
            {
                ret = FLASH_FS_EENCRYPT;
            }
        }
    }
    else
#endif /* FS_ENCRYPTION_SUPPORTED */
    {
        data = dataIn;
        len  = dataLenIn;
    }

    if (ret == FLASH_FS_OK)
    {
        int32_t littlefs_res = 0;

        /* This can fail TODO */
        littlefs_res = lfs_file_write(&s_LittlefsHandler.lfs, &file_meta->file, data, len);
        if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
    }
#if FS_ENCRYPTION_SUPPORTED
    if ((file_meta->encryptInfo.useEncryption) && (data != NULL))
    {
        vPortFree(data);
    }
#endif /* FS_ENCRYPTION_SUPPORTED */
    return ret;
}

static flash_fs_status_t LFS_GetFileContent(file_meta_t *file_meta,
                                                uint32_t offset,
                                                uint8_t *dataOut,
                                                uint32_t *dataLenOut)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    uint8_t *data         = NULL;
    uint8_t *dataPlain    = NULL;
    uint32_t len          = 0;

#if FS_ENCRYPTION_SUPPORTED
    if (file_meta->encryptInfo.useEncryption)
    {
        /* read the whole file */
        len  = file_meta->encryptInfo.dataEncLen;
        data = (uint8_t *)pvPortMalloc(len);
        if (data == NULL)
        {
            ret = FLASH_FS_ENOMEM3;
        }
        else
        {
            dataPlain = (uint8_t *)pvPortMalloc(len);
            if (dataPlain == NULL)
            {
                vPortFree(data);
                data = NULL;
                ret  = FLASH_FS_ENOMEM3;
            }
        }
    }
    else
#endif /* if FS_ENCRYPTION_SUPPORTED */
    {
        data = dataOut;
        len  = *dataLenOut;

        /* Move file pos to offset */
        if (offset != 0)
        {
            if (file_meta->file.ctz.size < offset)
            {
                ret = FLASH_FS_EINVAL3;
            }
            else
            {
                lfs_file_seek(&s_LittlefsHandler.lfs, &file_meta->file, offset, LFS_SEEK_SET);
            }
        }
    }

    if (ret == FLASH_FS_OK)
    {
        int32_t littlefs_res = 0;
        uint32_t realSize    = 0;
        do
        {
            /* Start reading from file */
            littlefs_res = lfs_file_read(&s_LittlefsHandler.lfs, &file_meta->file, (data + realSize), len);
            if (littlefs_res < 0)
            {
                ret = FLASH_FS_FAIL;
                break;
            }
            else if (littlefs_res == 0)
            {
                /* Nothing to read. Break */
                break;
            }

