nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/filesystem/flash_littlefs.c
            realSize += littlefs_res;
            len -= littlefs_res;
        } while (len > 0);

        len = realSize;
    }

    if (ret == FLASH_FS_OK)
    {
#if FS_ENCRYPTION_SUPPORTED
        if (file_meta->encryptInfo.useEncryption)
        {
            int32_t status = Decrypt_AES_CBC_PKCS7(&s_flashLittlefsEncCtx, data, len, dataPlain, &len);
            if (status == ENCRYPT_STATUS_OK)
            {
                if (len <= offset)
                {
                    ret = FLASH_FS_EINVAL3;
                }
                else
                {
                    len -= offset;

                    if (*dataLenOut > len)
                    {
                        *dataLenOut = len;
                    }

                    memcpy(dataOut, (uint8_t *)(dataPlain + offset), *dataLenOut);
                }
            }
            else
            {
                ret = FLASH_FS_EENCRYPT;
            }
        }
        else
#endif /* FS_ENCRYPTION_SUPPORTED */
        {
            *dataLenOut = len;
        }
    }

#if FS_ENCRYPTION_SUPPORTED
    if ((file_meta->encryptInfo.useEncryption) && (data != NULL))
    {
        vPortFree(data);
        vPortFree(dataPlain);
    }
#endif /* if FS_ENCRYPTION_SUPPORTED */
    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Init(uint8_t erase)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if (s_LittlefsHandler.lfsMounted == true)
    {
        return FLASH_FS_OK;
    }

    s_LittlefsHandler.lock = xSemaphoreCreateMutex();

    if (s_LittlefsHandler.lock == NULL)
    {
        ret = FLASH_FS_ENOLOCK;
    }

    if (FLASH_FS_OK == ret)
    {
        mflash_drv_init();
        LFS_GetDefaultConfig(&s_LittlefsHandler.cfg);
        if (erase)
        {
            lfs_format(&s_LittlefsHandler.lfs, &s_LittlefsHandler.cfg);
        }

        littlefs_res = lfs_mount(&s_LittlefsHandler.lfs, &s_LittlefsHandler.cfg);
        if (littlefs_res == 0)
        {
            s_LittlefsHandler.lfsMounted = 1;
        }
        else if (littlefs_res == LFS_ERR_CORRUPT)
        {
            lfs_format(&s_LittlefsHandler.lfs, &s_LittlefsHandler.cfg);
            littlefs_res = lfs_mount(&s_LittlefsHandler.lfs, &s_LittlefsHandler.cfg);
            if (littlefs_res == 0)
            {
                ret = FLASH_FS_OK;
            }
            else
            {
                ret = FLASH_FS_CORRUPTED;
            }
        }
        else
        {
            ret = FLASH_FS_FAIL;
        }

        if (FLASH_FS_OK != ret)
        {
            vSemaphoreDelete(s_LittlefsHandler.lock);
            s_LittlefsHandler.lock = NULL;
        }
        else
        {
#if FS_ENCRYPTION_SUPPORTED
            Encrypt_Init_Slot(&s_flashLittlefsEncCtx);
#endif /* FS_ENCRYPTION_SUPPORTED */
        }
    }

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Save(const char *name, uint8_t *data, uint32_t len)
{
    file_meta_t file_meta;
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if ((name == NULL) || (data == NULL) || (len == 0))
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    LFS_GetDefaultFileConfig(&file_meta);

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        littlefs_res =
            lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, name, LFS_O_CREAT | LFS_O_WRONLY, &file_meta.cfg);

        if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
        else
        {
            lfs_getattr(&s_LittlefsHandler.lfs, name, ATTR_ENCRYPT, file_meta.attrs[0].buffer, file_meta.attrs[0].size);
        }
    }

    if (ret == FLASH_FS_OK)
    {
        ret = LFS_SaveFileContent(&file_meta, data, len);
        lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
    }

    _unlock(s_LittlefsHandler.lock);

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Append(const char *name, uint8_t *data, uint32_t len)
{
    file_meta_t file_meta;
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if ((name == NULL) || (data == NULL) || (len == 0))
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    LFS_GetDefaultFileConfig(&file_meta);

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        littlefs_res = lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, name, LFS_O_APPEND | LFS_O_WRONLY,
                                        &file_meta.cfg);

        if (littlefs_res == LFS_ERR_NOENT)
        {
            ret = FLASH_FS_ENOENTRY2;
        }
        else if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
        else
        {
            lfs_getattr(&s_LittlefsHandler.lfs, name, ATTR_ENCRYPT, file_meta.attrs[0].buffer, file_meta.attrs[0].size);
            if (file_meta.encryptInfo.useEncryption)
            {
                /* Not supported for now */
                lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
                ret = FLASH_FS_FAIL;
            }
        }
    }

    if (ret == FLASH_FS_OK)
    {
        ret = LFS_SaveFileContent(&file_meta, data, len);
        lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
    }

    _unlock(s_LittlefsHandler.lock);

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Update(const char *name, uint8_t *data, uint32_t *len)
{
    file_meta_t file_meta;
    flash_fs_status_t ret;
    int32_t littlefs_res;

    if ((name == NULL) || (data == NULL) || (len == NULL))
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    LFS_GetDefaultFileConfig(&file_meta);

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        littlefs_res = lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, name, LFS_O_RDWR, &file_meta.cfg);
        if (littlefs_res == LFS_ERR_NOENT)
        {
            ret = FLASH_FS_ENOENTRY2;
        }
        else if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
        else
        {
            lfs_getattr(&s_LittlefsHandler.lfs, name, ATTR_ENCRYPT, file_meta.attrs[0].buffer, file_meta.attrs[0].size);
        }
    }

    if (ret == FLASH_FS_OK)
    {
        ret = LFS_SaveFileContent(&file_meta, data, *len);
        lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
    }

    _unlock(s_LittlefsHandler.lock);

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Read(const char *name, uint8_t *data, uint32_t offset, uint32_t *len)
{
    file_meta_t file_meta;
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if ((name == NULL) || (len == NULL))
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    LFS_GetDefaultFileConfig(&file_meta);

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        littlefs_res = lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, name, LFS_O_RDONLY, &file_meta.cfg);
        if (littlefs_res == LFS_ERR_NOENT)
        {
            ret = FLASH_FS_ENOENTRY2;
        }
        else if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
        else if ((littlefs_res == 0) && (data == NULL))
        {
            /* return ok. Set len file size */
            if (file_meta.encryptInfo.useEncryption)
            {
                *len = file_meta.encryptInfo.dataPlainLen;
            }
            else
            {
                *len = file_meta.file.ctz.size;
            }

