nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/source/filesystem/flash_littlefs.c
            lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
            ret = FLASH_FS_OK;
            goto exit;
        }
        else if (file_meta.file.ctz.size == 0)
        {
            lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
            memset(data, 0, *len);
            *len = 0;
            ret  = FLASH_FS_OK;
            goto exit;
        }
    }

    if (ret == FLASH_FS_OK)
    {
        /* Get Content from the file. If encrypt, /p data will contain decrypt info */
        ret = LFS_GetFileContent(&file_meta, offset, data, len);

        /* Move file pos back to begining */
        lfs_file_seek(&s_LittlefsHandler.lfs, &file_meta.file, 0, LFS_SEEK_SET);
        lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
    }

exit:
    _unlock(s_LittlefsHandler.lock);

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Erase(const char *name)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if (name == NULL)
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        littlefs_res = lfs_remove(&s_LittlefsHandler.lfs, name);
        if (littlefs_res == LFS_ERR_NOENT)
        {
            ret = FLASH_FS_ENOENTRY2;
        }
        else if (littlefs_res != 0)
        {
            ret = FLASH_FS_FAIL;
        }
    }
    _unlock(s_LittlefsHandler.lock);

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Deinit(uint8_t erase)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    if (erase)
    {
        lfs_format(&s_LittlefsHandler.lfs, &s_LittlefsHandler.cfg);
    }

    littlefs_res = lfs_unmount(&s_LittlefsHandler.lfs);

    if (littlefs_res != 0)
    {
        ret = FLASH_FS_FAIL;
    }
    else
    {
       // Encrypt_Deinit_Slot(&s_flashLittlefsEncCtx);
        s_LittlefsHandler.lfsMounted = false;
        vSemaphoreDelete(s_LittlefsHandler.lock);
        s_LittlefsHandler.lock = NULL;
    }

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_SetCbs(flash_fs_cbs_t *cbs)
{
    flash_fs_status_t ret = FLASH_FS_OK;

    if (NULL == cbs)
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    s_flashLittlefsCbs.pre_sector_erase_cb  = cbs->pre_sector_erase_cb;
    s_flashLittlefsCbs.post_sector_erase_cb = cbs->post_sector_erase_cb;
    s_flashLittlefsCbs.post_lock_cb         = cbs->post_lock_cb;
    s_flashLittlefsCbs.post_unlock_cb       = cbs->post_unlock_cb;

    _unlock(s_LittlefsHandler.lock);

    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Mkdir(const char *name)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;

    if (name == NULL)
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        littlefs_res = lfs_mkdir(&s_LittlefsHandler.lfs, name);
        if (littlefs_res == LFS_ERR_EXIST)
        {
            ret = FLASH_FS_FILEEXIST;
        }
        else if (littlefs_res != 0)
        {
            ret = FLASH_FS_FAIL;
        }
    }

    _unlock(s_LittlefsHandler.lock);
    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Mkfile(const char *name, bool encrypt)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;
    file_meta_t file_meta;

    if (name == NULL)
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    /* check if the dir exists */
    ret = LFS_CheckBasePath(name);

    if (ret == FLASH_FS_OK)
    {
        LFS_GetDefaultFileConfig(&file_meta);

        /* Try to read first */
        littlefs_res = lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, name, LFS_O_RDONLY, &file_meta.cfg);
        if (littlefs_res == LFS_ERR_NOENT)
        {
            /* No file found. Create it */
            littlefs_res = lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, name, LFS_O_CREAT, &file_meta.cfg);
            if (littlefs_res == 0)
            {
#if FS_ENCRYPTION_SUPPORTED
                file_meta.encryptInfo.useEncryption = encrypt;
#endif /* FS_ENCRYPTION_SUPPORTED */
                littlefs_res = lfs_setattr(&s_LittlefsHandler.lfs, name, ATTR_ENCRYPT, file_meta.attrs[0].buffer,
                                           file_meta.attrs[0].size);
            }
            else
            {
                ret = FLASH_FS_FAIL;
            }
        }
        else if (littlefs_res == 0)
        {
            ret = FLASH_FS_FILEEXIST;
        }
        else if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
    }

    if ((ret == FLASH_FS_OK) || (ret == FLASH_FS_FILEEXIST))
    {
        lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
    }

    _unlock(s_LittlefsHandler.lock);
    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Format()
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;
    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    littlefs_res = lfs_format(&s_LittlefsHandler.lfs, &s_LittlefsHandler.cfg);
    if (littlefs_res != 0)
    {
        ret = FLASH_FS_FAIL;
    }

    _unlock(s_LittlefsHandler.lock);
    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Rename(const char *oldName, const char *newName)
{
    flash_fs_status_t ret = FLASH_FS_OK;
    int32_t littlefs_res      = 0;
    file_meta_t file_meta;

    if ((oldName == NULL) || (newName == NULL))
    {
        return FLASH_FS_EINVAL;
    }

    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    /* check if the dir exists */
    ret = LFS_CheckBasePath(oldName);
    if (ret == FLASH_FS_OK)
    {
        ret = LFS_CheckBasePath(newName);
    }

    if (ret == FLASH_FS_OK)
    {
        LFS_GetDefaultFileConfig(&file_meta);
        littlefs_res = lfs_file_opencfg(&s_LittlefsHandler.lfs, &file_meta.file, oldName, LFS_O_RDONLY, &file_meta.cfg);
        if (littlefs_res == LFS_ERR_NOENT)
        {
            /* Old file doesn't exist */
            ret = FLASH_FS_ENOENTRY2;
        }
        else if (littlefs_res < 0)
        {
            ret = FLASH_FS_FAIL;
        }
    }

    if (ret == FLASH_FS_OK)
    {
        lfs_file_close(&s_LittlefsHandler.lfs, &file_meta.file);
        littlefs_res = lfs_rename(&s_LittlefsHandler.lfs, oldName, newName);
        if (littlefs_res)
        {
            ret = FLASH_FS_FAIL;
        }
    }

    _unlock(s_LittlefsHandler.lock);
    return ret;
}

flash_fs_status_t FLASH_LITTLEFS_Cleanup(uint32_t timeout_ms)
{
    flash_fs_status_t ret             = FLASH_FS_OK;
    int32_t littlefs_res                  = 0;
    uint32_t usedBlocks[LFS_SECTORS / 32] = {0};
    uint32_t startTime, currentTime, emptyBlocks;
    if (_lock(s_LittlefsHandler.lock))
    {
        return FLASH_FS_ENOLOCK;
    }

    /* create used block list */
    littlefs_res = lfs_fs_traverse(&s_LittlefsHandler.lfs, _lfs_traverse_create_used_blocks, &usedBlocks);

    if (littlefs_res)
    {
        ret = FLASH_FS_FAIL;
    }

    if (ret == FLASH_FS_OK)
    {
        startTime   = portTICK_PERIOD_MS * xTaskGetTickCount();
        emptyBlocks = 0;
        /* find next block starting from free.i */
        for (int i = 0; i < LFS_SECTORS; i++)
        {
            currentTime = portTICK_PERIOD_MS * xTaskGetTickCount();
            /* Check timeout */
            if ((timeout_ms) && (currentTime >= (startTime + timeout_ms)))
            {
                break;
            }

            lfs_block_t block = i;

            /* take next unused marked block */
            if (!_is_blockBitSet(usedBlocks, block))
            {
                LFS_FlashErase(&s_LittlefsConfigDefault, block);
                emptyBlocks += 1;
            }
        }
    }
    _unlock(s_LittlefsHandler.lock);
    return ret;
}
